In [2]:

# Import pandas and load data
import pandas as pd

titanic = pd.read_csv('Titanic Dataset.csv')

# Quick check
print(titanic.shape)
titanic.head()

(1309, 14)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
titanic['name']

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [6]:
titanic['fare']

0       211.3375
1       151.5500
2       151.5500
3       151.5500
4       151.5500
          ...
1304     14.4542
1305     14.4542
1306      7.2250
1307      7.2250
1308      7.8750
Name: fare, Length: 1309, dtype: float64

In [10]:
passenger_info= titanic[['name', 'sex', 'age', 'survived']]

passenger_info data.head(10)

In [12]:
titanic['survived'].info

<bound method Series.info of 0       1
1       1
2       0
3       0
4       0
       ..
1304    0
1305    0
1306    0
1307    0
1308    0
Name: survived, Length: 1309, dtype: int64>

In [15]:
titanic['sex'].info

<bound method Series.info of 0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: object>

In [16]:
titanic['pclass'].info

<bound method Series.info of 0       1
1       1
2       1
3       1
4       1
       ..
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, Length: 1309, dtype: int64>

In [18]:
titanic['age'].info

<bound method Series.info of 0       29.00
1        0.92
2        2.00
3       30.00
4       25.00
        ...
1304    14.50
1305      NaN
1306    26.50
1307    27.00
1308    29.00
Name: age, Length: 1309, dtype: float64>

In [19]:
titanic['pclass'].value_counts()

pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [20]:
titanic['sex'].value_counts()

sex
male      843
female    466
Name: count, dtype: int64

In [21]:
titanic['survived'].value_counts()

survived
0    809
1    500
Name: count, dtype: int64

In [23]:

# AND (&) - Both conditions must be True
# Find male survivors
female_survivors = titanic[
    (titanic['sex'] == 'female') & 
    (titanic['survived'] == 1)
]
print(f"female survivors: {len(female_survivors)}")

female survivors: 339

In [26]:
(titanic['pclass']==1)|(titanic['pclass']==2)

0        True
1        True
2        True
3        True
4        True
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: pclass, Length: 1309, dtype: bool

In [27]:
(titanic['sex']== 'male')&(titanic['age'])&(titanic['survived']== '1')&(titanic['fare'])

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Length: 1309, dtype: bool

In [29]:
(titanic['age'] == 12)

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: age, Length: 1309, dtype: bool

In [30]:
# Sort by class (ascending), then by fare within each class (descending)
sorted_df = titanic.sort_values(
    ['pclass', 'fare'],           # List of columns to sort by
    ascending=[True, False]        # True for ascending, False for descending
)

# Display name, class, and fare for first 20
print(sorted_df[['name', 'pclass', 'fare']].head(20))

# This groups by class first, then sorts by fare within each class

                                                  name  pclass      fare
49                  Cardeza, Mr. Thomas Drake Martinez       1  512.3292
50   Cardeza, Mrs. James Warburton Martinez (Charlo...       1  512.3292
183                             Lesurer, Mr. Gustave J       1  512.3292
302                                   Ward, Miss. Anna       1  512.3292
111                     Fortune, Miss. Alice Elizabeth       1  263.0000
112                         Fortune, Miss. Ethel Flora       1  263.0000
113                         Fortune, Miss. Mabel Helen       1  263.0000
114                     Fortune, Mr. Charles Alexander       1  263.0000
115                                  Fortune, Mr. Mark       1  263.0000
116                Fortune, Mrs. Mark (Mary McDougald)       1  263.0000
35                            Bowen, Miss. Grace Scott       1  262.3750
66                         Chaudanson, Miss. Victorine       1  262.3750
249                        Ryerson, Master. John Borie       1  262.3750
250                         Ryerson, Miss. Emily Borie       1  262.3750
251              Ryerson, Miss. Susan Parker "Suzette"       1  262.3750
252                         Ryerson, Mr. Arthur Larned       1  262.3750
253    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)       1  262.3750
16                            Baxter, Mr. Quigg Edmond       1  247.5208
17     Baxter, Mrs. James (Helene DeLaudeniere Chaput)       1  247.5208
97   Douglas, Mrs. Frederick Charles (Mary Helene B...       1  247.5208